app/Http/Controllers/Author/DashboardController.php

select * from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3, 5)
select * from `posts` where `user_id` = 2 order by `created_at` desc limit 10
---
    public function index()
    {
        $data = [
            'page_title'    => 'My Dashboard',
            'categories'    => Category::all(),
            'recent_posts'  => Post::with(['category'])
                ->where('user_id', auth()->user()->id)
                ->limit(10)
                ->orderBy('created_at','desc')
                ->get(),