app/Http/Controllers/Author/PostController.php

select * from `categories`
---
    public function __construct()
    {
        $this->module = 'Post';
        $this->categories = Category::all();

select * from `categories` where `categories`.`id` in (1, 2, 3, 5)
select * from `posts` where `user_id` = 2
select `tags`.*, `post_tags`.`post_id` as `pivot_post_id`, `post_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tags` on `tags`.`id` = `post_tags`.`tag_id` where `post_tags`.`post_id` in (1, 2, 3, 4, 5)
---
    public function index()
    {
        $data = [
            'page_title'    => 'My Post',
            'categories'    => $this->categories,
            'posts'         => Post::with(['category', 'tags'])
                ->where('user_id', auth()->user()->id)
                ->get(),